src/cf/InformationRegisters/КадроваяИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПродавца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПродавца</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КадроваяИстория/Ext/ManagerModule.bsl
Процедура ЗаписатьКадровуюИсторию(Сотрудник, НаДату, 
	СтатусПродавца, Магазин=Неопределено, Содержание="") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

    ЗаписьКадроваяИстория = РегистрыСведений.КадроваяИстория.СоздатьМенеджерЗаписи();
	ЗаписьКадроваяИстория.Сотрудник	 		= Сотрудник;
	ЗаписьКадроваяИстория.Прочитать();
	
	ЗаписьКадроваяИстория.Период			= НаДату;
	ЗаписьКадроваяИстория.ДатаСобытия 		= НаДату;
	ЗаписьКадроваяИстория.Сотрудник	 		= Сотрудник;
	
	ЗаписьКадроваяИстория.СтатусПродавца 	= СтатусПродавца;
	
	Если Магазин <> Неопределено Тогда 
		ЗаписьКадроваяИстория.Магазин 		= Магазин;
	Иначе
		ЗаписьКадроваяИстория.Магазин   	= Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	ЗаписьКадроваяИстория.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	
	Если Содержание <> "" Тогда 
		ЗаписьКадроваяИстория.Содержание 		= Содержание;	
	КонецЕсли;
	
	ЗаписьКадроваяИстория.Записать(Истина);					
			
	УстановитьПривилегированныйРежим(Ложь);	
			
КонецПроцедуры
